<template>
  <div id="center_fz8">

    <div ref="map_vkz" style=" width: 84%;
    height: 95vh;
    z-index: 1;
    position: absolute">

    </div>

  </div>

</template>

<script>

import L from 'leaflet';
import "leaflet/dist/leaflet.css";


export default {
// name: 'Test',
  mounted() {
    this.init_leaf();

  },


  data() {
    return {
      map: undefined,
    }
  },
  components: {},
  methods: {
    onMapClick(e) {
      this.popup
        .setLatLng(e.latlng)
        .setContent("Location:" + e.latlng.toString())
        .openOn(this.map);
    },
    onMapZoom() {
      // if (this.map.getZoom() > 9) {
      //   this.map.removeLayer(this.glayer_fusheqv);
      // }
      // if (this.map.getZoom() < 8) {
      //   this.map.addLayer(this.glayer_heituqv);
      //
      // }
      //
      // if (this.map.getZoom() < 9) {
      //
      //   this.map.addLayer(this.glayer_fusheqv);
      // }
    },
    init_leaf() {
      //创建地图
      this.map = L.map(this.$refs.map_vkz, {
        center: [46.46392, 127.005244],
        zoom: 6,
        crs: L.CRS.EPSG3857,
        maxZoom: 18,
        editable: true,
        // 去除放大缩小控件
        // https://stackoverflow.com/questions/16537326/leafletjs-how-to-remove-the-zoom-control
        zoomControl: false,
        layerControl: false,
        attributionControl: false,
        // Attribution: false,
      });
      this.popup = L.popup();
      this.map.on('click', this.onMapClick);
      this.map.on('zoom', this.onMapZoom);


      // 天地图地图及标示  osm，osm1.
      // this.osm = L.tileLayer('http://t4.tianditu.gov.cn/DataServer?T=vec_w&X={x}&Y={y}&L={z}&tk=57f1b8146ef867f14189f3f4bb1adc1c', {
      //   title: '天地图网格图',
      //   maxZoom: 18,
      //   id: "mapbox.streets"
      // });
      this.osm1 = L.tileLayer('http://t4.tianditu.gov.cn/DataServer?T=cia_w&X={x}&Y={y}&L={z}&tk=57f1b8146ef867f14189f3f4bb1adc1c', {
        title: '天地图中文标注',
        maxZoom: 18,
        id: "mapbox.streets"
      });

      this.osm2 = L.tileLayer('http://t4.tianditu.gov.cn/DataServer?T=img_w&X={x}&Y={y}&L={z}&tk=57f1b8146ef867f14189f3f4bb1adc1c', {
        title: '影像',
        maxZoom: 18,
        id: "mapbox.streets"
      });

      this.osm2.addTo(this.map);

      var gsonTaizhan = {
        "type": "FeatureCollection",
        "name": "taizhan",
        "crs": {"type": "name", "properties": {"name": "urn:ogc:def:crs:OGC:1.3:CRS84"}},
        "features": [
          {
            "type": "Feature",
            "geometry": {
              "type": "Polygon",
              "coordinates": [[[126.07289872000001, 41.538669722000066], [126.10913999400009, 41.51759870400008], [126.10669587200005, 41.50305821000006], [126.12518355000009, 41.484380599000076], [126.11921193800003, 41.458855664000055], [126.124389844, 41.44158816700008], [126.11513488000003, 41.410499928000036], [126.14114320800002, 41.40344710000005], [126.15853858800006, 41.337620926000056], [126.18025831600005, 41.34050838500008], [126.20358407900005, 41.32904487500008], [126.22715016400002, 41.34443358000004], [126.26150993200008, 41.34410643800004], [126.28440370100009, 41.35094996200007], [126.31639038900005, 41.371346526000025], [126.30818856500002, 41.38105844300003], [126.31811920000007, 41.40827763100003], [126.34623138200004, 41.42558624700007], [126.34569282000007, 41.445668958000056], [126.39539720200003, 41.47442944900007], [126.38235756400002, 41.48994887100008], [126.39352004400007, 41.51433377400008], [126.42269736000003, 41.50732737700008], [126.43475929100009, 41.51759476600006], [126.45897437500003, 41.517595164000056], [126.46123316600006, 41.50036830800008], [126.49850228900004, 41.49943171600006], [126.51981927200006, 41.533785968000075], [126.5477779040001, 41.53261421800005], [126.54545989600001, 41.512711953000064], [126.53008983600012, 41.479230243000075], [126.50355856800002, 41.43811832000006], [126.49265454900001, 41.40562669900004], [126.50998723300006, 41.36383655100008], [126.48804590500004, 41.372810764000064], [126.45782368000005, 41.35842228200005], [126.43181950700011, 41.35199855700006], [126.43063742100003, 41.32980589500005], [126.4036567490001, 41.327808821000076], [126.39263870100001, 41.30218897900005], [126.36133167500009, 41.282196414000055], [126.35390098700009, 41.24568080300003], [126.3164121320001, 41.22910880400008], [126.30499649700005, 41.19022177800008], [126.28387220500008, 41.18894079800003], [126.2896710650001, 41.16932692000006], [126.26983526200002, 41.15462705700003], [126.22852145500008, 41.14189823000004], [126.22469512300006, 41.12991097200006], [126.1858819680001, 41.11634314400004], [126.17851131800012, 41.102680133000035], [126.15708695600006, 41.08989087500004], [126.1187508700001, 41.090261128000066], [126.10864011700005, 41.06984956400004], [126.13004641500004, 41.05604978800005], [126.12570219600002, 41.04475775700007], [126.094383504, 41.034367745000054], [126.10241977900012, 41.00269905700003], [126.07489602500004, 41.004665111000065], [126.0606711050001, 40.99177078300005], [126.07737901300004, 40.97578497000006], [126.04899699900011, 40.96395400200004], [126.0475027650001, 40.94558768200005], [126.03169451600002, 40.93671773500006], [125.99775138300004, 40.93379044500006], [126.00032384700012, 40.91499007900006], [126.01878339900009, 40.89999204500003], [125.99315636400001, 40.89446643900004], [125.96637054900009, 40.90235786200003], [125.94984629600003, 40.879338361000066], [125.9145769800001, 40.88328314700004], [125.9070041120001, 40.89380271700003], [125.8746180490001, 40.90652706900005], [125.85516320600004, 40.884000951000075], [125.82245242700003, 40.872772086000055], [125.78513903100009, 40.88908733900007], [125.75922623300005, 40.88913069600005], [125.74673789600001, 40.868378697000026], [125.70166370400011, 40.87088570000003], [125.67902859700007, 40.89897690200007], [125.64436800300007, 40.91408522300003], [125.57975672900011, 40.88965527600004], [125.5717295390001, 40.89918185200003], [125.59006218800005, 40.93080026200005], [125.60835635100011, 40.94021344400005], [125.63000815800001, 40.94025437400006], [125.6468442910001, 40.970178721000025], [125.67814710400012, 40.984208386000034], [125.67323544900012, 40.99816974300006], [125.68205948200011, 41.02344065200003], [125.7035992110001, 41.03544673000005], [125.72053158000006, 41.053264237000064], [125.73358021900003, 41.08679330100006], [125.70645274200001, 41.09364866200008], [125.72936347900009, 41.123874855000054], [125.75090828300006, 41.127512187000036], [125.7597596170001, 41.146391279000056], [125.78525059300011, 41.164238829000055], [125.73136244900002, 41.177540659000044], [125.7295339850001, 41.192208305000065], [125.75193318100003, 41.229551994000076], [125.74398987000006, 41.24293817000006], [125.68903918100011, 41.242474677000075], [125.6801683760001, 41.270854116000066], [125.6419992970001, 41.26218807400005], [125.63626775600005, 41.29432057200006], [125.61438940000005, 41.31632522000007], [125.62983048400008, 41.32243114500005], [125.6248109610001, 41.35019732500007], [125.60396272900005, 41.36202927100004], [125.63670675700007, 41.381368071000054], [125.6536687900001, 41.37074726800006], [125.6698378960001, 41.383472072000075], [125.64364187900003, 41.40785313600003], [125.67240031900008, 41.41204304900003], [125.68310332200008, 41.44385142400006], [125.70133806500007, 41.452912508000054], [125.73277238700007, 41.45180293100003], [125.75965309800006, 41.470051872000056], [125.7485616990001, 41.482780459000026], [125.78800302500008, 41.486812875000055], [125.79445257400005, 41.51645894200004], [125.82028716600007, 41.53403810400005], [125.8225048380001, 41.559301299000026], [125.85562288900007, 41.56952136600006], [125.87729996500002, 41.57065380200004], [125.88071561900006, 41.59171543300005], [125.89534637800011, 41.59571622400006], [125.92766248500004, 41.58277039700005], [125.95448333700006, 41.57843949200003], [125.9747459460001, 41.58219970500005], [125.98750062900001, 41.56136912000005], [126.02438644500012, 41.56481570100004], [126.06530461600005, 41.54838544200004], [126.07289872000001, 41.538669722000066]]]
            }, "id": 220582, "properties": {"PAC": 220582, "label": "集安市", "cityName": "通化市辖区"}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "海伦站",
              "kind": "1",
              "introduce": "海伦农田生态系统国家野外科学观测研究站(简称“海伦站”) ，位于黑龙江省海伦市，始建于1978年，命名为“中国科学院海伦农业生态实验站”，是中国科学院在我国东北黑土区设置的长期的、综合性的农业资源、环境、生态等多学科的综合研究基地。2005年，海伦站加入国家野外科学观测研究网络，定名为“黑龙江海伦农田生态系统国家野外科学观测研究站”。目前，海伦站是中国唯一从事黑土农业生态系统长期定位监测、研究与示范的国家级野外台站。" +
                "<br>海伦站站区所代表的我国东北平原黑土区总面积为700万公顷，其中耕地面积474万公顷，分布于黑龙江、吉林、内蒙古东北部及辽宁省北部，其中黑龙江省黑土耕地面积为360万公顷，占东北黑土总耕地面积的76%。海伦站地处小兴安岭向松嫩平原过渡带的海伦市，该区域位于东北黑土区的中心，是我国大型商品粮基地县（市），是我国东北黑土区农田生态系统的典型代表。 ",
              "edit": "侯广冰", "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0201x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [126.916666666666671, 47.45]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "大安站",
              "kind": "1",
              "introduce":
                "中国科学院大安碱地生态试验站（简称：大安站）。大安站建成于2003年，是中国科学院和吉林省政府院地合作的重要成果，该站的建设先后得到中国科学院、吉林省政府、吉林省国家农业综合开发办、大安市委市政府的鼎力支持。大安站位于东北松嫩平原西南部，属于东北765万公顷盐碱土典型分布区，具有鲜明的区域和学科代表性，是我国第一个以典型内陆苏打盐碱土为主要监测和研究对象的野外台站。历经17年的建设与科学积累，大安站在服务国家和地方重大需求与面向国民经济主战场方面发挥着越来越重要的作用，团队先后承担了30多项国家973计划、重点研发等项目，继2010年在退化植被恢复方面首次获得国家科技进步二等奖后，2015年在盐碱地以稻治碱大规模改土增粮方面再次取得突破，获得了第2项国家科技进步二等奖，截止目前，已累计获得省部级一、二等奖6项，2019年被农业农村部认定为国家农业野外观测站。"
              ,
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0205x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [123.85, 45.6]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "长岭站",
              "kind": "1",
              "introduce": "中国科学院长岭草地农牧生态研究站于2009年建立，实验站面积达4500亩，投入专项经费支持台站基础设施和人才队伍建设，并与东北师范大学、吉林大学、东北农业大学以及美国、澳大利亚、新西兰等国内外研究单位合作开展科学研究，集中了土壤学、生态学、植物学、动物学等多学科专家学者，对盐碱化草地植物生长适应策略、盐碱化草地生态系统过程与功能、盐碱化草地恢复、改良与优化利用、盐碱化草地牧草资源培育及其利用、盐碱化草地放牧饲养及其牲畜设计饲养等多个方向开展深入系统研究。在Journal of Ecology、Functional Ecology、Annals of Botany等一流国际刊物发表SCI论文150余篇，申请发明专利60余项，授权专利20余项，处于国内一流水平。获批国家重点研究计划课题、国家自然科学基金重点项目、中科院战略先导专项子课题等项目50余项，经费达3000余万元。目前与东北师范大学联合申请并获批了吉林松嫩草地生态系统野外科学观测研究站。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0206x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [123.625748396779713, 44.480718056290833]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "水保站",
              "kind": "1",
              "introduce": "中国科学院海伦水土保持监测站位于黑龙江省海伦市前进乡光荣村小流域，地理位置为东经126°41′，北纬47°27′，位于东北典型黑土带的中部，多年均降雨为530 mm，土壤为中层黑土，原始植被为黑土发生的“五花草塘”，地形地貌为漫川漫岗。从气候、土壤、植被和地形地貌以及水土流失状况，海伦水土保持监测站均有显著的代表性。<br>海伦水土保持" +
                "监测站依托中国科学院东北地理与农业生态研究所，现为国家松辽流域7个重点监测站点和黑龙江省3个重点监测站点之一。1984年成为中国科学院黑土侵蚀研究基地，2007年成为全国水土流失动态监测与公告项目30个重点监测小流域之一，2008年成为中国科学院侵蚀退化黑土阻控技术试验示范区和国家松嫩平原侵蚀黑土农田保水保肥技术试验示范区，2010年联合国教科文生态水文（EHP）全球示范基地，2011年获中国水利学会资助，建设成为黑土区水土保持技术标准化示范区，2013年成为国家外专局“黑土侵蚀治理技术”引智示范基地。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0202x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [126.833333333333329, 47.35]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "长春站",
              "kind": "1",
              "introduce": "长春综合农业试验站是根据中国科学院东北地理与农业生态研究所高新北区新园区的整体发展规划要求于2012年成立的，是以中国科学院东北地理与农业生态研究所“创新2020”规划为指导，围绕研究所战略定位和发展目标，以研究所涉农学科组为技术依托，科学规划、合理布局，高标准、高起点建设的农业试验示范基地。<br>" +
                "长春综合农业试验站的基本定位是：根据国家资源环境安全和建设东北优质商品粮基地的需要，立足东北薄层黑土地区，开展长期定位监测与综合研究，把试验站建设成为：黑土农田生态系统长期定位监测和基础数据积累基地、东北农业重大关键问题研发基地、人才培养和教学实验及科普教育基地、国内外学术交流与合作研究基地。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0213x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [125.410276, 44.007712]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "辽河源基地",
              "kind": "1",
              "introduce": "中国科学院辽河源生态农业研究与示范基地（简称辽河源基地）是根据《中国科学院东北地理与农业生态研究所与辽源市人民政府战略合作框架协议》有关精神和要求于2017年3月成立的，基地位于辽源市东辽县辽河源镇英武村，地处东辽河源头，属长白山余脉向松嫩平原过度地带，为温带半湿润地区，属大陆性季风气候。区域未来重点发展低污染、低能耗、高技术密集型、高经济附加值产业，形成了特色生态农业、特色生态观光旅游、特色现代农业科技等独具特色的产业。<br>" +
                "基地定位: 以发展水源地生态农业为核心，主要从事现代生态农业、水源地生态保护、林下经济、美丽乡村建设等领域的现代农业高新技术研究与示范。<br>" +
                "建设目标：建立水源地可持续发展的高效现代农业生产模式，建成中科院农业领域高新技术成果推广示范平台，建立我国水源地美丽乡村建设示范样板。 <br>" +
                "基地规模：基地拥有建设用地20亩，拟与2021年建成1600平方米办公楼，完成20亩地园区建设。目前流转土地面积975.55亩，其中水田140亩，平地450亩，坡耕地385.55亩。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0209x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [125.410276, 42.89]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "三江站",
              "kind": "2",
              "introduce": "中国科学院三江平原沼泽湿地生态试验站位于黑龙江省三江平原腹地的同江市东南部（47°35N，133°31 E），始建于1986年，1992年成为中国生态系统研究网络（CERN）的基本站，2005年成为国家野外观测研究站。试验站依托单位中国科学院东北地理与农业生态研究所，现任站长宋长春研究员。<br>" +
                "目前在我国已有的台站中，是唯一从事沼泽湿地生态及湿地农田生态系统长期定位监测与研究的野外台站。 三江平原是中国最大的淡水沼泽集中分布区之一，代表着我国中纬度冷湿（季节性冻融）低平原沼泽湿地典型分布区。三江站以三江平原沼泽湿地为主要对象，开展 沼泽湿地生态系统要素和主要生态过程长期定位观测，为沼泽湿地生态过程、区域沼泽湿地资源保护、区域生态与环境安全管理等研究提供科学支撑平台。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0212x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [133.51666666666668, 47.583333333333336]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "兴凯湖站",
              "kind": "2",
              "introduce":
                "兴凯湖湿地生态系统国家野外科学观测研究站（以下简称兴凯湖站）位于黑龙江省密山市兴凯湖国家级自然保护区。始建于2009年，2014年晋升为中国科学院野外台站，2020年入选“国家野外科学观测研究站择优建设名单”。兴凯湖站主要以温带湿润区沼泽湿地为主要观测研究对象，基于对沼泽湿地生态系统要素及水文、水环境、水鸟及其栖息地的长期定位观测与综合研究，揭示湿地演变与湖泊水文、水环境变化间的关系、湖泊湿地的环境容量和承载力变化及其对区域生态环境和农业可持续发展的影响、湿地生物多样性变化及其稳定性维持机制；研发湿地恢复及资源可持续利用技术，建立退化湿地恢复试验示范区，提出北方退化沼泽湿地健康评价指标和综合恢复技术、保育与管理模式及资源可持续利用途径，为区域生态安全和界湖资源合理利用提供长期基础数据支撑、理论依据与关键技术，成为我国湿地生态系统观测研究与人才培养基地、国际合作交流与研究的重要平台。"
              ,
              "edit": "侯广冰",
              "edit_time": "2021-07-02",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0211x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [132.342, 45.368]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "盘锦站",
              "kind": "2",
              "introduce": "中国科学院盘锦滨海湿地生态观测研究站是中国科学院东北地理与农业生态研究所所属的野外台站之一，是东北湿地生态系统观测研究网络的重要组成部分。东北湿地生态系统观测研究网络以中国科学院三江平原沼泽湿地生态试验站为核心站，包括中国科学院大兴安岭森林湿地生态观测研究站（寒温带）、中国科学院兴凯湖湿地生态观测研究站(中温带)、中国科学院盘锦滨海湿地生态观测研究站（暖温带），形成了覆盖东北地区主要温度带和湿地类型的野外长期定位观测网络。该平台以东北地区湿地生态系统为主要对象，开展沼泽湿地生态系统要素和主要生态过程长期定位观测，为沼泽湿地生态过程、区域沼泽湿地资源保护、区域生态与环境安全管理等研究提供科学支撑平台",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0216x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [121.61276487537279, 40.966465420243082]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "大兴安岭站",
              "kind": "2",
              "introduce":
                "大兴安岭森林湿地生态研究站位于黑龙江省加格达奇松岭区南瓮河国家级湿地自然保护区，2010年秋季，中国科学院东北地理与农业生态研究所与大兴安岭南瓮河湿地自然保护区签订了“关于共建南瓮河自然保护区湿地观测站的协议”，至此大兴安岭森林湿地生态所级站正式成立，成为东北湿地观测研究网络的重要台站之一。大兴安岭森林湿地站位于欧亚大陆连续多年冻土区的南缘，区内湿地生态系统面积广阔，生态站主要以多年冻土区不同植被类型沼泽湿地（森林湿地、灌丛湿地及草本湿地）为研究对象，辅助观测森林生态系统。站区分别分布在大兴安岭伊勒呼里山的南坡和北坡。南坡观测站址在南瓮河国家湿地自然保护区的中心站试验区，北坡观测站址在漠河县图强镇东5公里处。<br>" +
                "采用长期野外定位观测与控制实验等研究方法，揭示气候变化主要因子对湿地生态系统结构、关键生态过程的影响及水源涵养、生物多样性保护、碳蓄积等生态服务功能的影响；探讨寒区森林-湿地生态系统对全球气候变化的响应过程和机制；明确冻土-湿地-森林之间对气候变化的协同响应及物质与能量交换。"
              ,
              "edit": "侯广冰",
              "edit_time": "2021-07-05",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0215x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [125.5, 51.416666666666664]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "盐碱湿地站",
              "kind": "2",
              "introduce": "地处生态脆弱带的松嫩平原西部半干旱地区，是中国内陆盐碱湿地集中分布的区域之一，但目前呈不同程度的退化，部分已演变成寸草不生的碱斑地。为了探索内陆退化盐碱湿地生态恢复重建与合理利用方面的技术模式，以刘兴土院士为首的科研团队从2002年开始，在松嫩平原西部霍林河流域，对严重退化的牛心套保芦苇湿地进行了生态恢复研究与示范，并应用生态学的生物共生与物质循环原理，建立了苇-鱼（蟹）-稻复合生态工程模式，社会、经济与生态效益显著，建成退化盐碱湿地恢复示范区50000亩。2013年东北地理所与吉林省林业厅联合在示范区建立了湿地恢复与合理利用研究示范基地，2015年，研究所将基地列入“东北湿地生态系统观测研究网络建设”，设立“中国科学院松嫩平原西部盐碱湿地生态研究站”。2017年4月1日，中国科学院东北地理与农业生态研究所与大安市政府隆重举行了战略合作协议签约暨中国科学院松嫩平原西部盐碱湿地生态研究站揭牌仪式，研究站进入新的建设发展阶段，研究对象覆盖松嫩平原西部所有盐碱湿地。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0210x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [123.35, 45.233333333333334]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "净月潭站",
              "kind": "4",
              "introduce": "中国科学院净月潭遥感实验站始创于20世纪70年代,是我国刚刚开始引进遥感技术就率先起步的遥感基地。正式创建于1985年，由三家单位共同支撑，依次为长春精密光学机械研究所、长春地理所和长春物理研究所；于1989年4月被正式批准为院级开放野外台站。自1979年举办综合性航空遥感试验以来，不断发展壮大，已成为我国历史最长、综合性很强的遥感试验基地之一。由于中国科学院网络台站运行体制的调整，2002年开始转为由中国科学院东北地理与农业生态研究所独家支撑运行。<br>" +
                "遥感站以净月潭国家森林公园及其周边的农田、水体、城市农地为主体工作区，同时设有4个东北典型生态系统辐射实验区，依次为：长白山森林生态遥感辐射区、三江平原洪河湿地遥感辐射区、辽河口滨海湿地生态系统辐射区、大安碱地生态系统辐射区。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0207x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [125.433333333333337, 43.783333333333331]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "乌兰敖都站",
              "kind": "1",
              "introduce": "乌兰敖都荒漠化防治生态试验站（简称\"乌兰敖都站\"）建于1975年，是中国科学院沈阳应用生态研究所（原\"中国科学院林业土壤研究所\"）在科尔沁沙地设立的野外站。乌兰敖都站位于内蒙古自治区赤峰市翁牛特旗，地理坐标：E119°39′，N43°02′，海拔479m。2000年进入国家林业和草原局荒漠化监测网络站，2009年加入中国荒漠化监测中心沙尘暴地面定位监测台站，2013年加入中国荒漠-草地生态系统观测研究野外站联盟。" +
                "<br>" +
                "台站定位：针对我国北方农牧交错区土地沙漠化和草地退化等重大生态问题，开展植被过程、生态水文过程、土壤过程、景观过程及其调控机制研究，开展退化草地改良、草田防护林营建、流沙治理工程技术研发、集成和示范，构建土地优化利用，生态、生产及生活效益兼顾，生态环境保护与经济发展协调的资源利用和发展模式，监测相关自然、经济和社会要素的时空变化趋势，为我国北方半干旱风沙区的荒漠化防治、资源可持续利用、生态文明建设和经济发展提供科技支撑。",
              "edit": "侯广冰",
              "edit_time": "2021-07-02",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0203x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [119.5, 43.033333333333331]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "额尔古纳站",
              "kind": "3",
              "introduce": "额尔古纳森林草原过渡带生态系统研究站于2020年被学会批准为中国生态学学会生态科普教育基地。额尔古纳森林草原过渡带生态系统研究站隶属于中国科学院沈阳应用生态研究所，位于内蒙古自治区呼伦贝尔市额尔古纳黑山头镇，于2015年8月投入使用。站内标本馆、报告厅和科普展厅建筑面积均为160平方米，可同时容纳100人开展标本制作、科普讲座和科普参观；共有各类实验室18个，住宿和膳食条件优越，可同时承担120人的食宿。" +
                "<br>" +
                "承担多项国家重点研发项目、973课题、自然基金委重点基金、中科院先导B类子课题。近年来新争取到国家自然基金优青项目、院先导A类子课题、省重大科技专项等重要科研项目的支持,为科普实践活动的开展提供了基础科研导向。自建站以来，致力于通过加强研究站管理和实验样地建设，并本着开放共享的理念，积极吸引所内外优秀学者来站开展研究，取得了显著成效。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0217x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [119.5, 50.2]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "长白山站", "kind": "3", "introduce":
                "长白山湿地生态吉林省野外观测站（以下简称长白山站）位于吉林省长白山地区，主要包括以下4个野外站点：吉林龙湾湿地生态定位研究站、吉林哈泥泥炭沼泽生态定位研究站、吉林和龙泉水河湿地生态定位研究站、吉林园池湿地生态定位研究站。长白山湿地生态吉林省野外观测站由中国科学院东北地理与农业生态研究所、东北师范大学和延边大学联合共建，2019年入选吉林省野外观测站。通过联网观测和协同，实现长白山地区湿地资源的科学保护，解决湿地利用与保护双赢等重大区域环境生态问题，充分发挥湿地的生态、经济和社会效益，并积累湿地管理经验和培养管理型人才，从而支撑吉林省生态文明建设和重大决策，保障区域生态安全。",
              "edit": "侯广冰", "edit_time": "2021-07-02",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0204x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [128.466666666666669, 42.4]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "沈阳站",
              "kind": "1",
              "introduce":
                "中国科学院沈阳生态实验站（以下简称“沈阳站”）位于辽宁省沈阳市苏家屯区十里河镇（北纬41°31′，东经123°24′），现隶属于中国科学院沈阳应用生态研究所，致力于农业和生态环境研究。沈阳站于1987年开始选址、征地、规划和建设，在1989年首批进入中国科学院生态系统研究网络（CERN）。1992年被批准为CERN重点站；1997年被批准为中国科学院野外开放试验站。2005年正式被批准为国家野外科学观测研究站，并命名为“辽宁沈阳农田生态系统国家野外科学观测研究站”。<br>" +
                "沈阳站以辽河平原农田生态系统为研究对象，针对温带雨养农业的资源高效利用和东北老工业基地的污染土地安全利用的重大科学和技术问题，以农业生态学、土壤学和污染生态学为主学科，重点开展农田生态与农业生态工程、污染生态与环境生态工程研究。"
              ,
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0214x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [123.402794533316893, 41.596775398883018]}
          },
          {
            "type": "Feature",
            "properties": {
              "label": "清原站",
              "kind": "1",
              "introduce": "中科院清原森林生态系统观测研究站（简称“清原站”）始建于2003年，位于辽宁省抚顺市清原满族自治县大苏河乡长沙村（41º51′ 9.94″ N，124º56′ 11.22″ E）的龙岗山下（属长白山余脉）。清原站建站之初为中科院沈阳应用生态研究所“所级站”，2012年被正式批准为中科院“院级站”，2014年成为中国生态系统观测研究网络（CERN）站；现为我国东北温带次生林生态系统集野外监测、研究、试验、示范、教学和科普于一体的综合支撑平台。<br>" +
                "清原站以我国东北（温带）典型次生林生态系统为对象，从个体、种群、群落、生态系统到景观/流域尺度，开展次生林生态系统的长期野外定位观测与试验；结合室内模拟试验、景观模型，采用多方法印证、多过程融合和模型模拟等技术手段，进行长期定位观测、研究及基础数据积累；同时，注重林下资源开发、试验示范和技术推广，为东北温带次生林生态系统研究提供研究平台。",
              "edit": "侯广冰",
              "edit_time": "2021-07-01",
              "img": "http://r.osgeo.cn:8008/htimg/taizhan/i0208x.webp"
            },
            "geometry": {"type": "Point", "coordinates": [124.933333333333337, 41.85]}
          }
        ]
      }
      var geojsonLayer = new L.GeoJSON(gsonTaizhan);//加载位于 data 文件夹下的 GeoJSON 数据
      geojsonLayer.bindTooltip(function (layer) { //设置提示框
        var feat = layer.feature; //获取选中的要素
        return feat.properties.label;//获取地物要素的名称，并作为提示框显示内容
      }, {
        sticky: true,//提示框随鼠标光标的移动而移动，默认为false,提示框显示在地物要素中心
      }).addTo(this.map);

      L.control.scale({
        position: 'topright',
        maxWidth: '100',
        imperial: false
      }).addTo(this.map);

    },


  }
}
</script>

<style lang="scss" scoped>


#center_fz8 {
  height: 95vh;
}
</style>
